{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_5",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              63
            ],
            "dtype": "float32",
            "sparse": false,
            "name": "input_1"
          },
          "inbound_nodes": [],
          "name": "input_1"
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_15",
            "trainable": true,
            "dtype": "float32",
            "units": 512,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            }
          },
          "name": "dense_15",
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_16",
            "trainable": true,
            "dtype": "float32",
            "units": 256,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            }
          },
          "name": "dense_16",
          "inbound_nodes": [
            [
              [
                "dense_15",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_17",
            "trainable": true,
            "dtype": "float32",
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            }
          },
          "name": "dense_17",
          "inbound_nodes": [
            [
              [
                "dense_16",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_18",
            "trainable": true,
            "dtype": "float32",
            "units": 26,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            }
          },
          "name": "dense_18",
          "inbound_nodes": [
            [
              [
                "dense_17",
                0,
                0,
                {}
              ]
            ]
          ]
        }
      ]
    },
    "keras_version": "2.15.0",
    "backend": "tensorflow"
  },
  "format": "layers-model",
  "generatedBy": "keras-to-tfjs-converter",
  "convertedBy": null,
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense_15/kernel",
          "shape": [
            63,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_15/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_16/kernel",
          "shape": [
            512,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_16/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_17/kernel",
          "shape": [
            256,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_17/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_18/kernel",
          "shape": [
            64,
            26
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_18/bias",
          "shape": [
            26
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}