{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_5",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              60,
              63
            ],
            "dtype": "float32",
            "sparse": false,
            "name": "input_1"
          },
          "inbound_nodes": [],
          "name": "input_1"
        },
        {
          "class_name": "LSTM",
          "config": {
            "name": "lstm_10",
            "trainable": true,
            "dtype": "float32",
            "units": 128,
            "activation": "tanh",
            "recurrent_activation": "sigmoid",
            "use_bias": true,
            "return_sequences": true,
            "return_state": false,
            "go_backwards": false,
            "stateful": false,
            "unroll": false,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "recurrent_initializer": {
              "class_name": "Orthogonal",
              "config": {
                "gain": 1.0,
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            }
          },
          "name": "lstm_10",
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "LSTM",
          "config": {
            "name": "lstm_11",
            "trainable": true,
            "dtype": "float32",
            "units": 128,
            "activation": "tanh",
            "recurrent_activation": "sigmoid",
            "use_bias": true,
            "return_sequences": false,
            "return_state": false,
            "go_backwards": false,
            "stateful": false,
            "unroll": false,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "recurrent_initializer": {
              "class_name": "Orthogonal",
              "config": {
                "gain": 1.0,
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            }
          },
          "name": "lstm_11",
          "inbound_nodes": [
            [
              [
                "lstm_10",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_15",
            "trainable": true,
            "dtype": "float32",
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            }
          },
          "name": "dense_15",
          "inbound_nodes": [
            [
              [
                "lstm_11",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_16",
            "trainable": true,
            "dtype": "float32",
            "units": 32,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            }
          },
          "name": "dense_16",
          "inbound_nodes": [
            [
              [
                "dense_15",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_17",
            "trainable": true,
            "dtype": "float32",
            "units": 20,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            }
          },
          "name": "dense_17",
          "inbound_nodes": [
            [
              [
                "dense_16",
                0,
                0,
                {}
              ]
            ]
          ]
        }
      ]
    },
    "keras_version": "2.15.0",
    "backend": "tensorflow"
  },
  "format": "layers-model",
  "generatedBy": "keras-to-tfjs-converter",
  "convertedBy": null,
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "lstm_10/kernel",
          "shape": [
            63,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_10/recurrent_kernel",
          "shape": [
            128,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_10/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_11/kernel",
          "shape": [
            128,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_11/recurrent_kernel",
          "shape": [
            128,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_11/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_15/kernel",
          "shape": [
            128,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_15/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_16/kernel",
          "shape": [
            64,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_16/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_17/kernel",
          "shape": [
            32,
            20
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_17/bias",
          "shape": [
            20
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}